config/cf/Enums/СобытиеОбслуживания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СобытиеОбслуживания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Добавление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Enums/ВидыОкончанияОбслуживания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыОкончанияОбслуживания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееОбслуживание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееОбслуживаниеПроизведеноСразу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбслуживаниеКонтрагентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбслуживаниеКонтрагентомПроизведеноСразу</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Enums/СобытиеОбслуживания/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	мСобытиеОбслуживания= Перечисления.СобытиеОбслуживания;
	мВидСобытия			= Неопределено;
	Если Параметры.Отбор.Свойство("ВидОкончанияОбслуживания", мВидСобытия) Тогда
		Если мВидСобытия = Перечисления.ВидыОкончанияОбслуживания.ВнутреннееОбслуживание
			Или мВидСобытия = Перечисления.ВидыОкончанияОбслуживания.ВнутреннееОбслуживаниеПроизведеноСразу
			Или мВидСобытия = Перечисления.ВидыОкончанияОбслуживания.ОбслуживаниеКонтрагентом
			Или мВидСобытия = Перечисления.ВидыОкончанияОбслуживания.ОбслуживаниеКонтрагентомПроизведеноСразу Тогда
			ДанныеВыбора = Новый СписокЗначений;
			ДанныеВыбора.Добавить(мСобытиеОбслуживания.Списание);
			ДанныеВыбора.Добавить(мСобытиеОбслуживания.НаСклад);
		Иначе			
			ДанныеВыбора = Новый СписокЗначений;					
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
